
Функция ВставитьЭлементФормы(Элементы, ИмяЭлемента, ПутьКДанным, Группа = "", Следующий = "", ТипЭлемента = "ПолеФормы", ВидПоля = "ПолеВвода")	Экспорт	
	_Группа = ?(ТипЗнч(Группа) = Тип("Строка"), Элементы.Найти(Группа), Группа);
	_Следующий = ?(ТипЗнч(Следующий) = Тип("Строка"), Элементы.Найти(Следующий), Следующий);
	// Группа определена некорректно, но Следующий есть - вставим элемент в родителя следующего
	Если _Следующий <> Неопределено Тогда 
		_Группа = _Следующий.Родитель;
	КонецЕсли;
	
	Элемент = Элементы.Найти(ИмяЭлемента);
	Если Элемент = Неопределено Тогда	
		Элемент = Элементы.Вставить(ИмяЭлемента, Тип(ТипЭлемента), _Группа, _Следующий);
		Если ЗначениеЗаполнено(ВидПоля) Тогда
			Элемент.Вид = ВидПоляФормы[ВидПоля];
		КонецЕсли;
		Если ЗначениеЗаполнено(ПутьКДанным) Тогда
			Элемент.ПутьКДанным = ПутьКДанным;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Элемент;
КонецФункции
