
Вызов формы выбора с определенным отбором

&НаСервереБезКонтекста 
Функция МассивСтатусов()
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.СтатусыПланов.ВПодготовке);
	МассивСтатусов.Добавить(Перечисления.СтатусыПланов.НаУтверждении);
	МассивСтатусов.Добавить(Перечисления.СтатусыПланов.Утвержден);
	Возврат МассивСтатусов;	
КонецФункции

&НаКлиенте
Процедура БюджетКомпанииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МассивСтатусов = МассивСтатусов();	
	МассивПараметров = Новый Массив(Элемент.ПараметрыВыбора);
	
	НовыйПараметр = Новый ПараметрВыбора("СтатусыОтбораДляПланируемойВыплаты", МассивСтатусов);
	МассивПараметров.Добавить(НовыйПараметр);
	
	НовыеПараметры = Новый ФиксированныйМассив(МассивПараметров);
	
	Элемент.ПараметрыВыбора = НовыеПараметры; 
	
КонецПроцедуры
