	 //Открывает полученный документ из сервиса 1С:Бизнес-сеть по публичной временной ссылке из QR-кода.
	
	 //Параметры:
	 // ВладелецФормы           - ФормаКлиентскогоПриложения - владелец открываемой формы, которому будет отправлено оповещение о выборе.
	 // УникальныйИдентификатор - УникальныйИдентификатор    - уникальный идентификатор.
	 // ПубличнаяСсылкаQRкода   - Строка                     - сокращенная публичная ссылка.
	 // ОписаниеПриЗавершении   - ОписаниеОповещения         - оповещение, которое необходимо вызвать после завершения метода. 
	Процедура ПолучитьДанныеДокументаПоQRКоду(Знач ВладелецФормы, Знач УникальныйИдентификатор, Знач ПубличнаяСсылкаQRкода,
											Знач ОписаниеПриЗавершении = Неопределено) Экспорт
	
	АдресРесурса = СтрЗаменить(ПубличнаяСсылкаQRкода, "https://1c.ru/m/", "");
	
	ДлительнаяОперация = БизнесСетьВызовСервера.ПолучитьДанныеДокументаПоQRКодуВФоне(УникальныйИдентификатор, АдресРесурса);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ВладелецФормы);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения    = Истина;
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеПриЗавершении, ПараметрыОжидания);
	
	// ПолучитьДанныеДокументаПоQRКодуВФоне
	НаименованиеЗадания = НСтр("ru = '1С:Бизнес-сеть. Получение документа по QR-коду.';
								|en = '1C:Business Network. Retrieving document by QR code.'");
	ИмяПроцедуры        = "БизнесСеть.ПолучитьДанныеДокументаПоQRКоду";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ДополнительныеПараметры, ПараметрыВыполнения);
	
	ДлительныеОперации.ВыполнитьПроцедуру(, 