
&После("ПриОпределенииОбъектовСКомандамиПечати")
Процедура яя_ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)
	
	СписокОбъектов.Добавить(Документы.яя_БюджетЦФО);
	СписокОбъектов.Добавить(Документы.яя_БюджетКомпании);
	СписокОбъектов.Добавить(Документы.яя_ЛокацииСотрудников);
	СписокОбъектов.Добавить(Документы.яя_ПеремещениеМеждуЦФО);
	СписокОбъектов.Добавить(Документы.яя_СоцпакетСотрудников);
	СписокОбъектов.Добавить(Документы.яя_МатрицаЗаработнойПлаты);
	СписокОбъектов.Добавить(Документы.яя_РасчетСтавокВмененныхРасходов);
	СписокОбъектов.Добавить(Документы.яя_ПрогнознаяСделка);							//яя_Айтеко $ДОБ Н-00000019
	СписокОбъектов.Добавить(Документы.яя_НачислениеПремий);
	СписокОбъектов.Добавить(Документы.яя_СервисныеУслуги);							//яя_Айтеко $ДОБ Н-00000122
	СписокОбъектов.Добавить(Документы.яя_НеподтвержденнаяВыручка);  
	СписокОбъектов.Добавить(Документы.яя_ПланируемаяВыплата);						//яя_Айтеко $ДОБ Н-00000422
	СписокОбъектов.Добавить(Документы.яя_ПланВыплат);								//яя_Айтеко $ДОБ Н-00000422
	СписокОбъектов.Добавить(Документы.яя_БюджетСделки);								//яя_Айтеко $ДОБ Н-00000428
	СписокОбъектов.Добавить(Документы.яя_СостояниеСделок);							//яя_Айтеко $ДОБ Н-00000438
	СписокОбъектов.Добавить(Документы.яя_ВыводСотрудниковВШтат);					//яя_Айтеко $ДОБ Н-00000450
	СписокОбъектов.Добавить(Документы.яя_НачислениеВыплатыЗаВыводСотрудников);		//яя_Айтеко $ДОБ Н-00001096
	
КонецПроцедуры
