
Регистратор это 

Свойство	Значение	Тип
Регистратор	Заказ клиента ИЦРБ-000157 от 05.10.2022 13:47:26	ДокументСсылка.ЗаказКлиента


ДвиженияДокумента это

Значение элемента	Тип элемента	Ключ	Значение
КлючИЗначение	КлючИЗначение	Расчеты с клиентами по срокам	"ДокументРегистратор"
КлючИЗначение	КлючИЗначение	Плановые отгрузки клиентам	"ДокументРегистратор"
КлючИЗначение	КлючИЗначение	Запасы и потребности	"Регистратор"
КлючИЗначение	КлючИЗначение	Плановые оплаты клиентов	"ДокументРегистратор"
КлючИЗначение	КлючИЗначение	Распределение запасов - Движения	"Регистратор"
КлючИЗначение	КлючИЗначение	Состояние сделок (АйТ)	"Регистратор"
КлючИЗначение	КлючИЗначение	Заказы клиентов	"Регистратор"
КлючИЗначение	КлючИЗначение	Денежные средства безналичные план	"Регистратор"
КлючИЗначение	КлючИЗначение	Рамочные договоры (АйТ)	"Регистратор"
КлючИЗначение	КлючИЗначение	Фактические данные бюджетирования	"Регистратор"
КлючИЗначение	КлючИЗначение	Обороты спецификации (АйТ)	"Регистратор"
КлючИЗначение	КлючИЗначение	Суммы документов в валютах учета	"Регистратор"
КлючИЗначение	КлючИЗначение	Расчеты с клиентами	"Регистратор"
КлючИЗначение	КлючИЗначение	Обороты бюджетов компании (АйТ)	"Регистратор"
КлючИЗначение	КлючИЗначение	Остатки бюджетов (АйТ)	"Регистратор"
КлючИЗначение	КлючИЗначение	Обороты бюджетов итоги (АйТ)	"Регистратор"
КлючИЗначение	КлючИЗначение	Заказы клиентов по датам отгрузки (АйТ)	"Регистратор"
КлючИЗначение	КлючИЗначение	Расчеты с клиентами по документам	"Регистратор"
КлючИЗначение	КлючИЗначение	Показатели бюджетов сделок (АйТ)	"Регистратор"
КлючИЗначение	КлючИЗначение	Товары к отгрузке	"Регистратор"



Функция КоличествоЗаписейПоРегистратору(Регистратор, ДвиженияДокумента)
	
	РассчитанноеКоличество = Новый Соответствие;
	Если ДвиженияДокумента.Количество() = 0 Тогда
		Возврат РассчитанноеКоличество;
	КонецЕсли;
	
	ТекстЗапроса = "";
	Для Каждого Движение Из ДвиженияДокумента Цикл
		
		МетаданныеРегистра = Движение.Ключ;
		
		Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеРегистра) Тогда
			Продолжить;
		КонецЕсли;
		
		ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
		
		ТекстЗапросаШаблон =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""&ПолноеИмяРегистра"" КАК ПолноеИмяРегистра,
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|ГДЕ
		|	&Условие";
		
		ТекстУсловия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 = &ДокументВладелец", Движение.Значение);
		ТекстЗапросаШаблон = СтрЗаменить(ТекстЗапросаШаблон, "&ПолноеИмяРегистра", СтрЗаменить(ПолноеИмяРегистра, ".", "_"));
		ТекстЗапросаШаблон = СтрЗаменить(ТекстЗапросаШаблон, "&Условие", ТекстУсловия);
		ТекстЗапросаШаблон = СтрЗаменить(ТекстЗапросаШаблон, "&ТекущаяТаблица", ПолноеИмяРегистра);
		
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			
			ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 ОБЪЕДИНИТЬ ВСЕ  %2", ТекстЗапроса, СтрЗаменить(ТекстЗапросаШаблон, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ")); // @query-part-2 @query-part-3 для этого случая
			
		Иначе
			ТекстЗапроса = ТекстЗапросаШаблон;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументВладелец", Регистратор);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		РассчитанноеКоличество.Вставить(СтрокаРезультата.ПолноеИмяРегистра, СтрокаРезультата.Количество);
	КонецЦикла;
	
	ОтчетОДвиженияхДокументаПереопределяемый.ПриРасчетеКоличестваЗаписей(Регистратор, РассчитанноеКоличество);
	
	Возврат РассчитанноеКоличество;
	
КонецФункции
