			Если Параметр <> Неопределено И Источник.Объект <> Неопределено И ТипЗнч(Параметр)=Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
				//Параметры = Новый Структура;
				//Параметры.Вставить("Документ", Параметр);
				////Параметры.Вставить("СтатусПроверки", Перечисления.ЭтапыПроверкиДокументаВРеглУчете.Проверен);
				//ОткрытьФорму("РегистрСведений.СтатусыПроверкиДокументов.ФормаЗаписи", Параметры,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );				
				
				СтруктураЗаписи = Новый Структура("Документ, Организация", Параметр, Источник.Объект.Организация);
				МассивСтруктураЗаписи = Новый Массив;
				МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
				КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.СтатусыПроверкиДокументов", МассивСтруктураЗаписи);
				
				Параметрыформы = Новый Структура("Ключ", КлючЗаписи);                            
				ОткрытьФорму("РегистрСведений.СтатусыПроверкиДокументов.ФормаЗаписи", Параметрыформы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );
				
				
			КонецЕсли;