
&ДатаНачала
&ДатаОкончания

// Получаем окончание даты от выбранной дыты
// то есть если ДатаПлатежа 13.01.2022 то получаем 13.01.2022 23:59:59
КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ)

// Получаем окончание даты от выбранной дыты
// то есть если ДатаПлатежа 13.01.2022 то получаем 14.01.2022 23:59:59
КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, 1), ДЕНЬ)

// Получаем окончание даты от выбранной дыты
// то есть если ДатаПлатежа 13.01.2022 то получаем 15.01.2022 23:59:59
КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, 2), ДЕНЬ)



// Получаем окончание месяца от выбранной дыты
// то есть если ДатаПлатежа 13.01.2022 то получаем 31.01.2022 23:59:59
КОНЕЦПЕРИОДА(яя_ПланВыплатРасшифровкаПлатежа.ДатаПлатежа, МЕСЯЦ)

// Добавление к текущей записи дата начала один месяц с указанием его оекончяния
// то есть если ДатаПлатежа 13.01.2022 то получаем 28.02.2022 23:59:59
КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(яя_ПланыВыплатКомпании.Период, МЕСЯЦ, 1), МЕСЯЦ)

// Добавление к текущей записи дата начала два месяца с указанием его оекончяния
// то есть если ДатаПлатежа 13.01.2022 то получаем 31.03.2022 23:59:59
КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(яя_ПланВыплатРасшифровкаПлатежа.ДатаПлатежа, МЕСЯЦ, 2), МЕСЯЦ)	


