	СписокДокументовПоГЗ = ПолучитьСписокДокументовИзРСГлобальногоЗначения();
	
Функция ПолучитьСписокДокументовИзРСГлобальногоЗначения()
	
	МассивДанных = Новый Массив;

	Список_ДокументыДляИзмененияСтатуса = ПолучитьГлобальноеЗначениеСериализованное("Список_ДокументыДляИзмененияСтатуса");
	Если Список_ДокументыДляИзмененияСтатуса <> Неопределено Тогда
		Для Каждого СтрокаСписка Из Список_ДокументыДляИзмененияСтатуса Цикл 
			МассивДанных.Добавить(СтрокаСписка.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивДанных;
	
КонецФункции 