
В документе в тч при выборе договора 

//яя_Айтеко $ДОБ Н-00001134
&НаКлиенте
Процедура ВыходыСотрудниковДоговорРекрутераОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьДоговорЗавершение", ЭтотОбъект);
	
	Если ВыбранноеЗначение = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда		
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", Новый Структура("ДоговорСРекрутером", "ДоговорСРекрутером"),,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	ИначеЕсли ВыбранноеЗначение = Тип("СправочникСсылка.яя_РамочныеДоговорыГПХ") Тогда		
		ОткрытьФорму("Справочник.яя_РамочныеДоговорыГПХ.ФормаВыбора", Новый Структура("ДоговорСРекрутером", "ДоговорСРекрутером"),,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоговорЗавершение(ДоговорыКонтрагентов, Параметры) Экспорт

   Если ДоговорыКонтрагентов = Неопределено Тогда
         Возврат;
   КонецЕсли;  
  
   //Проверим наличие 
   Если Объект.ВыходыСотрудников.НайтиСтроки(
         Новый Структура("ДоговорРекрутера", ДоговорыКонтрагентов)).Количество() > 0 Тогда
         ПоказатьПредупреждение(,ДоговорыКонтрагентов +  НСтр("ru = 'Договор уже существует!'", "ru"));
         Возврат;
   КонецЕсли;   
   
  // Добавление в текущую строку данного договора 
   Элементы.Выходысотрудников.ТекущиеДанные.ДоговорРекрутера = ДоговорыКонтрагентов;
 	   
КонецПроцедуры

&НаКлиенте
Процедура ВыходыСотрудниковДоговорРекрутераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	                                                                       
	Если Этаформа.Элементы.ВыходыСотрудников.ТекущиеДанные.ДоговорРекрутера <> Неопределено Тогда 
		Этаформа.Элементы.ВыходыСотрудников.ТекущиеДанные.ДоговорРекрутера = Неопределено;
	КонецЕсли;
КонецПроцедуры



в орме выбора справочника 


&НаСервере
Процедура яя_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)							   
	
	//яя_Айтеко $ДОБ Н-00001134
	Если Параметры.Свойство("ДоговорСРекрутером") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидДоговора");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение = Справочники.яя_ВидыДоговоровКонтрагентов.НайтиПоНаименованию("С рекрутером", Истина);		
	КонецЕсли;
	
КонецПроцедуры
