	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);


			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В документе %1 отсутствуют товары. Печать накладной не требуется';
				|en = 'Goods are missing in document %1. Printing of the invoice is not required'"),
			ДанныеПечати.Ссылка);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка);
			Продолжить;


		ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр("ru = 'СЛУЖЕБНАЯ ЗАПИСКА';|en = 'Memo document'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		
		
		
// Обновляет список команд в зависимости от текущего контекста формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура НачатьОбновлениеКоманд(Форма) Экспорт
	Форма.ОтключитьОбработчикОжидания("Подключаемый_ОбновитьКоманды");
	Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКоманды", 0.2, Истина);
КонецПроцедуры



яя_НачислениеВыплатыЗаВыводСотрудниковВнешниеРекрутеры.ТипРекрутера = ЗНАЧЕНИЕ(ПеречислениеСсылка.яя_ТипыРекрутеров.ОЗГПриказ)

ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)

