ВЫБОР
	КОГДА ТИПЗНАЧЕНИЯ(ТаблицаРеестрДокументов.Контрагент) = ТИП(Справочник.КлючиРеестраДокументов)
		ТОГДА ЛОЖЬ
	КОГДА НЕ ТаблицаРеестрДокументов.Контрагент В (&ПустыеЗначенияКлючей)
			И КлючиРеестраДокументовКонтрагент.Ссылка ЕСТЬ NULL
		ТОГДА ИСТИНА
	ИНАЧЕ ЛОЖЬ
КОНЕЦ



ВЫБОР
	КОГДА ТИПЗНАЧЕНИЯ(ТаблицаРеестрДокументов.МестоХранения) = ТИП(Справочник.КлючиРеестраДокументов)
		ТОГДА ТаблицаРеестрДокументов.МестоХранения
	ИНАЧЕ ЕСТЬNULL(КлючиРеестраДокументовМестоХранения.Ссылка, ЗНАЧЕНИЕ(Справочник.КлючиРеестраДокументов.ПустаяСсылка))
КОНЕЦ